dist/blog/how-i-build-this.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-12-31 Wed 17:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How I Built This Website</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://albus-droid.github.io/portfolio/templates/style.css"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.9.0/styles/atom-one-dark.min.css"></head>
<body>
<div id="preamble" class="status">
<h1 id="name-typewriter"></h1>
<div class="container">
    <div class="social-links">
        <a href="https://github.com/albus-droid" target="_blank" rel="noopener noreferrer" aria-label="GitHub">
            <svg role="img" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><title>GitHub</title><path d="M12 .297c-6.63 0-12 5.373-12 12 0 5.303 3.438 9.8 8.205 11.385.6.113.82-.258.82-.577 0-.285-.01-1.04-.015-2.04-3.338.724-4.042-1.61-4.042-1.61C4.422 18.07 3.633 17.7 3.633 17.7c-1.087-.744.084-.729.084-.729 1.205.084 1.838 1.236 1.838 1.236 1.07 1.835 2.809 1.305 3.495.998.108-.776.417-1.305.76-1.605-2.665-.3-5.466-1.332-5.466-5.93 0-1.31.465-2.38 1.235-3.22-.135-.303-.54-1.523.105-3.176 0 0 1.005-.322 3.3 1.23.96-.267 1.98-.399 3-.405 1.02.006 2.04.138 3 .405 2.28-1.552 3.285-1.23 3.285-1.23.645 1.653.24 2.873.12 3.176.765.84 1.23 1.91 1.23 3.22 0 4.61-2.805 5.625-5.475 5.92.42.36.81 1.096.81 2.22 0 1.606-.015 2.896-.015 3.286 0 .315.21.69.825.57C20.565 22.092 24 17.592 24 12.297 24 5.67 18.627.297 12 .297z"/></svg>
        </a>
        <a href="https://linkedin.com/in/albin-babu-varghese" target="_blank" rel="noopener noreferrer" aria-label="LinkedIn">
        <svg role="img" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><title>LinkedIn</title><path d="M20.447 20.452h-3.554v-5.569c0-1.328-.027-3.037-1.852-3.037-1.853 0-2.136 1.445-2.136 2.939v5.667H9.351V9h3.414v1.561h.046c.477-.9 1.637-1.85 3.37-1.85 3.601 0 4.267 2.37 4.267 5.455v6.286zM5.337 7.433a2.062 2.062 0 0 1-2.063-2.065 2.064 2.064 0 1 1 2.063 2.065zm1.782 13.019H3.555V9h3.564v11.452zM22.225 0H1.771C.792 0 0 .774 0 1.729v20.542C0 23.227.792 24 1.771 24h20.451C23.2 24 24 23.227 24 22.271V1.729C24 .774 23.2 0 22.225 0z"/></svg>
        </a>
        <a href="mailto:albinbabuvarghese@gmail.com" aria-label="Email">
        <svg role="img" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><title>Email</title><path d="M24 5.457v13.909c0 .904-.732 1.636-1.636 1.636h-3.819V11.75L12 16.625l-6.545-4.875v9.25H1.636C.732 21 .001 20.269.001 19.366V5.457c0-2.023 2.309-3.178 3.927-1.964L5.455 4.64 12 9.548l6.545-4.908 1.528-1.145C21.69 3.28 24 4.435 24 5.457z"/></svg>
        </a>
    </div>
    <div style="display: flex; align-items: center; gap: 1rem;">
        <a href="/" class="nav-link">[HOME]</a>
        <a href="resume.html" class="nav-link">[RESUME]</a>
    </div>
</div>
<script src="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.9.0/highlight.min.js"></script>
<script>
document.querySelectorAll('pre[class*="src-"]').forEach(pre => {
  const match = pre.className.match(/src-(\w+)/);
  if (match) {
    const lang = match[1];
    let code = pre.querySelector('code');
    if (!code) {
      code = document.createElement('code');
      code.textContent = pre.textContent;
      pre.textContent = '';
      pre.appendChild(code);
    }
    code.className = `language-${lang}`;
  }
});
hljs.highlightAll();
</script>
</div>
<div id="content" class="content">
<h1 class="title">How I Built This Website</h1>
<p>
I stumbled upon <a href="https://ogbe.net/blog/emacs_org_static_site">this blog post</a> about building a static site with Emacs Org mode, and it clicked immediately. I was thinking about starting a blog to document my work and share what I&rsquo;m learning, so I decided to build my own static site generator instead of using something off-the-shelf.
</p>
<div id="outline-container-org322ca05" class="outline-3">
<h3 id="org322ca05">Why Build My Own SSG?</h3>
<div class="outline-text-3" id="text-org322ca05">
<p>
Sure, Hugo and Jekyll exist. They&rsquo;re great tools. But I wanted to understand the process from scratch, and I was curious about using Emacs&rsquo; built-in HTML publishing capabilities as the foundation.
</p>

<p>
Is this a complete SSG? No. It&rsquo;s maybe 20% of what a typical SSG offers, but it handles 80% of what I actually need. That&rsquo;s the sweet spot - build what you need, skip the rest.
</p>
</div>
</div>
<div id="outline-container-orgbef853e" class="outline-3">
<h3 id="orgbef853e">What This Does</h3>
<div class="outline-text-3" id="text-orgbef853e">
<ul class="org-ul">
<li>Exports Org files to HTML with a custom template</li>
<li>Generates the site structure automatically</li>
<li>Handles syntax highlighting for code blocks</li>
<li>Adds interactive features like copy buttons and back-to-top</li>
<li>Supports light/dark theme switching</li>
<li>Builds everything with a simple <code>make blog</code> command</li>
</ul>
</div>
</div>
<div id="outline-container-org983403e" class="outline-3">
<h3 id="org983403e">The Design</h3>
<div class="outline-text-3" id="text-org983403e">
<p>
I wanted something minimal and terminal-inspired. Dark background with golden accents, monospace fonts everywhere, no clutter. The landing page has a typewriter effect for my name and simple icon links to GitHub, LinkedIn, and email.
</p>

<p>
The aesthetic is somewhere between retro terminal and modern minimalism. Clean, functional, and distinctly mine.
</p>
</div>
</div>
<div id="outline-container-org2477f53" class="outline-3">
<h3 id="org2477f53">The Stack</h3>
<div class="outline-text-3" id="text-org2477f53">
<ul class="org-ul">
<li><b>Emacs Org mode</b> for content and publishing</li>
<li><b>HTML/CSS</b> for structure and theming</li>
<li><b>JavaScript</b> for interactive features</li>
<li><b>Highlight.js</b> for syntax highlighting</li>
<li><b>Makefile</b> for build automation</li>
<li><b>GitHub Actions</b> for CI/CD</li>
<li><b>Cloudflare Pages</b> for hosting</li>
</ul>
</div>
</div>
<div id="outline-container-org471cc5f" class="outline-3">
<h3 id="org471cc5f">Key Features</h3>
<div class="outline-text-3" id="text-org471cc5f">
</div>
<div id="outline-container-org41a63c4" class="outline-4">
<h4 id="org41a63c4">Syntax Highlighting</h4>
<div class="outline-text-4" id="text-org41a63c4">
<p>
Using Highlight.js with the Atom One Dark theme. Code blocks automatically detect the language from Org&rsquo;s <code>#+begin_src</code> blocks. Added a copy button that appears on hover - small touch, but makes code snippets way more useful.
</p>
</div>
</div>
<div id="outline-container-org15795c4" class="outline-4">
<h4 id="org15795c4">Automated Builds</h4>
<div class="outline-text-4" id="text-org15795c4">
<p>
GitHub Actions watches the <code>contents/</code> folder. Any push triggers <code>make blog</code>, builds the site, commits the <code>dist/</code> folder back to the repo, and Cloudflare Pages deploys automatically. Zero manual steps.
</p>
</div>
</div>
</div>
<div id="outline-container-orga3fbd6d" class="outline-3">
<h3 id="orga3fbd6d">The Build Process</h3>
<div class="outline-text-3" id="text-orga3fbd6d">
<p>
The <code>publish.el</code> file does the heavy lifting. It:
</p>

<ol class="org-ol">
<li>Fetches the HTML template from the live site</li>
<li>Processes all <code>.org</code> files in <code>contents/</code></li>
<li>Applies the template as a preamble</li>
<li>Injects CSS and JavaScript links</li>
<li>Outputs everything to <code>dist/</code></li>
</ol>

<p>
Running <code>make blog</code> just calls <code>emacs --batch -l publish.el</code>. Simple, reproducible, no complex build system needed.
</p>
</div>
</div>
<div id="outline-container-org077c55f" class="outline-3">
<h3 id="org077c55f">The Template System</h3>
<div class="outline-text-3" id="text-org077c55f">
<p>
The layout lives in <code>layout-fragment.html</code>. It&rsquo;s just the header section - navigation, social links, name with typewriter effect. Org mode&rsquo;s <code>:html-preamble</code> inserts it at the top of every page.
</p>

<p>
Content headings start at <code>h3</code> because the page title is <code>h1</code> and table of contents uses <code>h2</code>. This keeps the semantic HTML clean.
</p>
</div>
</div>
<div id="outline-container-org2ed840f" class="outline-3">
<h3 id="org2ed840f">Styling Philosophy</h3>
<div class="outline-text-3" id="text-org2ed840f">
<p>
CSS uses HSL color variables for theming. The dark theme uses <code>hsl(0 0% 13%)</code> for background and <code>hsl(42 100% 50%)</code> for the golden accent. Light theme flips to <code>hsl(0 0% 98%)</code> background with adjusted accent colors.
</p>

<p>
Inline code uses monospace font but inherits the text color - no background boxes or borders. Just a font change. Keeps it minimal.
</p>

<p>
Code blocks get the full treatment - background, border, syntax highlighting, line numbers for blocks over 5 lines, and that copy button.
</p>
</div>
</div>
<div id="outline-container-org46cd14a" class="outline-3">
<h3 id="org46cd14a">The Typewriter Effect</h3>
<div class="outline-text-3" id="text-org46cd14a">
<p>
The name animation on the landing page types out character by character with a blinking cursor. Had to:
</p>

<ul class="org-ul">
<li>Loop through each character with <code>setTimeout</code></li>
<li>Add a CSS-animated cursor that blinks</li>
<li>Make sure it respects <code>prefers-reduced-motion</code></li>
<li>Handle the cursor position properly at the end</li>
</ul>

<p>
The cursor uses CSS <code>@keyframes</code> to fade in and out, giving it that authentic terminal feel.
</p>
</div>
</div>
<div id="outline-container-orga0e2ae5" class="outline-3">
<h3 id="orga0e2ae5">Challenges and Solutions</h3>
<div class="outline-text-3" id="text-orga0e2ae5">
</div>
<div id="outline-container-org6227335" class="outline-4">
<h4 id="org6227335">Challenge: Inline code wasn&rsquo;t styled</h4>
<div class="outline-text-4" id="text-org6227335">
<p>
Solution: Added CSS targeting <code>:not(pre) &gt; code</code> to style inline code differently from code blocks.
</p>
</div>
</div>
<div id="outline-container-org26c2dbf" class="outline-4">
<h4 id="org26c2dbf">Challenge: Manual builds were tedious</h4>
<div class="outline-text-4" id="text-org26c2dbf">
<p>
Solution: Set up GitHub Actions to build and commit on any push to <code>contents/</code>.
</p>
</div>
</div>
<div id="outline-container-org3560485" class="outline-4">
<h4 id="org3560485">Challenge: Title was always <code>h1</code></h4>
<div class="outline-text-4" id="text-org3560485">
<p>
Solution: Used <code>:html-toplevel-hlevel 3</code> to make content headings start at <code>h3</code>, keeping proper semantic structure.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf75b76d" class="outline-3">
<h3 id="orgf75b76d">What I Learned</h3>
<div class="outline-text-3" id="text-orgf75b76d">
<p>
Building from scratch taught me more about HTML semantics, CSS organization, and build systems than any tutorial. You learn by solving real problems, not by following step-by-step guides.
</p>

<p>
The 80/20 rule applies perfectly here. I spent 20% of the effort to get 80% of the functionality. The remaining 20% of features would take 80% more effort, and I don&rsquo;t need them yet.
</p>

<p>
Starting simple and adding features incrementally is the way. Don&rsquo;t try to build everything at once.
</p>
</div>
</div>
<div id="outline-container-org69d72b6" class="outline-3">
<h3 id="org69d72b6">Next Steps</h3>
<div class="outline-text-3" id="text-org69d72b6">
<ul class="org-ul">
<li>Add line numbers to longer code blocks (done via Highlight.js plugin)</li>
<li>Improve mobile navigation with a hamburger menu</li>
<li>Add article tags and filtering</li>
<li>Create a sitemap for SEO</li>
<li>Add related posts suggestions</li>
<li>Improve RSS feed with full content</li>
</ul>
</div>
</div>
<div id="outline-container-orge344e6e" class="outline-3">
<h3 id="orge344e6e">Why This Approach Works</h3>
<div class="outline-text-3" id="text-orge344e6e">
<p>
It&rsquo;s fast. No JavaScript framework, no build step complexity, just static HTML with progressive enhancement. Pages load instantly, work without JavaScript (mostly), and are easy to debug.
</p>

<p>
It&rsquo;s maintainable. Everything is in plain text Org files. No database, no CMS, no admin panel. Just files and version control.
</p>

<p>
It&rsquo;s mine. I understand every piece. When something breaks, I know where to look. When I want a feature, I know how to add it.
</p>
</div>
</div>
<div id="outline-container-org45ba5a0" class="outline-3">
<h3 id="org45ba5a0">Conclusion</h3>
<div class="outline-text-3" id="text-org45ba5a0">
<p>
Building your own static site generator isn&rsquo;t for everyone. But if you want to understand how things work, enjoy solving problems, and value having complete control over your tools, it&rsquo;s incredibly rewarding.
</p>

<p>
You&rsquo;ll learn more by building than by using someone else&rsquo;s solution. And at the end, you&rsquo;ll have something that&rsquo;s uniquely yours.
</p>

<p>
The code is simple, the design is clean, and it does exactly what I need. That&rsquo;s enough.
</p>

<hr />

<p>
Check out source code at <a href="https://github.com/albus-droid/portfolio">https://github.com/albus-droid/portfolio</a></p>
</div>
</div>
</div>
</body>
</html>
